import Button from '~/components/common/ui/Button'
import Popup from '~/components/common/ui/Popup'
import { IcoClipboard2Data02, IcoFileEarmarkText02, IcoSendCheck02 } from '~/publishing/components/common/ui/IcoGroup'

interface Props {
  isOpen: boolean
  onClose: () => void
}

const TermsPopup = ({ isOpen, onClose }: Props) => {
  return (
    <>
      <Popup
        isOpen={isOpen}
        onClose={onClose}
        hasCloseButtonLoading={false}
        hasCloseButton
        width={1010}
        title={'이용 약관'}
        buttons={<></>}
      >
        <div style={{ padding: '24px 0' }}>
          <div className="terms-popup">
            <div className="terms-popup__paragraph">
              <p>제 1조 (목적)</p>
              <ol>
                <li>
                  이 약관은 코리아뉴스와이어주식회사(이하 "회사")가 제공하는 뉴스와이어 및 제반 서비스의 이용과 관련하여
                  회사와 회원 등 사용자의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.
                </li>
              </ol>
            </div>

            <div className="terms-popup__paragraph">
              <p>제 2조 (정의)</p>
              <p>이 약관에서 사용하는 용어의 정의는 다음과 같습니다.</p>
              <ol>
                <li>"서비스"라 함은 뉴스와이어 및 관련 제반 서비스를 의미합니다.</li>
                <li>
                  "자료"라 함은 "서비스"에 제출하는 보도자료를 비롯해 문자, 사진, 동영상 및 각종 파일과 링크, 개인정보
                  등을 의미합니다.
                </li>
                <li>
                  "이용자"라 함은 “서비스”에 “자료”를 제출하거나, 뉴스와이어 및 관련 제반 서비스 사이트에 게재된
                  “자료”를 이용하는 고객을 의미합니다. 뉴스와이어 사이트에 가입한 회원도 “이용자”에 포함됩니다.
                </li>
                <li>
                  "유료서비스"라 함은 "회사"가 유료로 제공하는 각종 보도자료 배포 서비스 및 제반 서비스를 의미합니다.
                </li>
                <li>
                  "쿠폰"이라 함은 “유료서비스”의 효율적 이용을 위해 회사가 전자적 방법으로 지급하는 "서비스" 이용권을
                  의미합니다.
                </li>
              </ol>
            </div>

            <div className="terms-popup__paragraph">
              <p>제 3조 (이용자)</p>
              <ol>
                <li>
                  “서비스”에 보도자료 등 “자료”를 제출하는 “이용자”는 “회사”에 제출하는 “자료”가 정확하고 객관적이며,
                  타인의 명예를 훼손하지 않고 사용권, 상표권, 지적재산권, 사생활권, 인격권과 관련된 법률 및 규정에
                  위배되지 않음을 보증해야 합니다.
                </li>
                <li>
                  “서비스”에 “자료”를 제출하는 “이용자”는 자신의 귀책사유로 발생하는 “회사”의 손해 그리고 “서비스”를
                  통해 “자료”를 이용하는 언론사, 웹사이트, 데이터베이스 등 “이용자”의 손해에 대한 모든 책임을 부담한다는
                  것을 보증해야 합니다.
                </li>
                <li>
                  “서비스”에 “자료”를 제출하는 이용자는 자신의 귀책사유로 인하여 “회사”를 포함해 “서비스”를 통해 배포된
                  “자료”를 인용해 보도하거나 게재한 “이용자”가 제3자의 재산, 명예, 저작권 등 권리를 침해하여 분쟁이
                  발생한 경우, 이로부터 “회사” 및 “이용자”를 면책하고 방어하며, 자신의 비용 및 책임으로 이를 해결합니다.
                </li>
                <li>
                  “서비스”에 “자료”를 제출하는 “이용자”는 제출 자료에 잘못된 정보가 포함된 경우 이를 즉시 “회사”에
                  통보하고 이를 정정하는 “자료”를 “회사”에 제공해, “회사”가 즉시 수정 등 조치를 할 수 있도록 해야
                  합니다.
                </li>
                <li>
                  “서비스”에 가입한 회원은 자신의 뉴스와이어 계정을 타인에게 양도 또는 대여할 수 없으며, 타인이 사용할
                  수 없도록 아이디와 비밀번호를 안전하게 관리할 책임이 있습니다.
                </li>
                <li>
                  “이용자”는 “회사”의 “편집 가이드라인”에 적합한 보도자료를 제출해야 합니다. “회사”는 “편집
                  가이드라인”에 위배되는 보도자료의 배포를 거부할 수 있고, 제출자의 동의 없이 보도자료를 삭제할 수
                  있습니다. “편집 가이드라인”에 위배돼 “회사”가 “서비스”를 제공하지 않는 경우 요금을 부과하지 않습니다.
                </li>
                <li>
                  “회사”는 “회사”가 정한 보도자료 표준 양식에 따라 보도자료의 일부를 본질적 내용을 훼손하지 않는 범위
                  내에서 수정할 수 있습니다. “이용자”가 제출한 자료를 “회사”가 “이용자”의 동의를 얻어 수정하는 경우,
                  “자료”에 대한 책임은 “이용자”에게 있습니다.
                </li>
                <li>
                  “회사”는 “이용자”가 제출한 “자료”를 “회사”가 정한 일정한 스타일과 문법에 맞춰 편집 또는 가공할 수
                  있습니다.
                </li>
                <li>
                  “회사”는 “이용자”가 입력하거나 제출한 “자료”를 제3자에게 제공, 판매, 배포하거나 출판할 수 있는 권리를
                  갖습니다. 또한 배포를 전담하는 회사에게 의뢰해 재배포를 하게 할 수 있습니다.
                </li>
                <li>
                  "회사"는 "회원"이 이 약관의 의무를 위반하거나 "서비스"의 정상적인 운영을 방해하거나, 광고 및 스팸
                  발송에 “서비스”를 이용한 경우, 경고, 일시정지, 영구이용정지 등으로 "서비스" 이용을 제한할 수 있습니다.
                </li>
              </ol>
            </div>

            <div className="terms-popup__paragraph">
              <p>제 4조 (저작권)</p>
              <ol>
                <li>
                  “회사”는 다음과 같은 조건을 모두 만족시키는 경우, 합법적인 보도 목적을 위해 뉴스와이어 및 제반
                  사이트에 게재된 보도자료 전문을 게재할 수 있는 제한적인 재배포 권한을 “이용자”에게 부여합니다.
                  <ol>
                    <li>
                      ① 보도자료 전문 전체를 수정하지 않고 있는 그대로 게재해야 합니다. 보도자료 본문 맨 앞에 붙는 날짜,
                      뉴스와이어 표시를 제거하지 말아야 합니다.
                    </li>
                    <li>
                      ② 게재한 보도자료에 뉴스와이어 원본 보도자료 페이지의 웹사이트 주소를 링크로 삽입해야 합니다.
                    </li>
                  </ol>
                </li>
                <li>“서비스”를 통해 배포된 보도자료는 “회사”의 사전 동의 없이 상업적인 목적으로 사용할 수 없습니다.</li>
                <li>
                  “서비스”를 통해 배포된 보도자료를 뉴스와이어와 경쟁하거나, 경쟁을 준비 중인 서비스에 사용할 수
                  없습니다.
                </li>
                <li>
                  “서비스”를 통해 배포된 보도자료를 불법적이거나 유해하다고 생각되는 내용이나 자료와 함께 사용하는 행위,
                  보도자료에 대해 증오나 수치심을 주기 위한 목적으로 이용하는 행위, 또는 저작자에게 불쾌감을 주는 데
                  이용하는 행위는 금지됩니다.
                </li>
                <li>
                  “회사”는 “이용자”의 사이트와 콘텐츠에서 뉴스와이어가 배포한 보도자료 또는 보도자료를 인용해 작성한
                  기사를 삭제하거나 수정하도록 요청할 수 있으며 “이용자”는 특별한 이유가 없는 한 24 시간 이내에 이
                  요청에 따라야 합니다.
                </li>
                <li>
                  뉴스와이어 사이트의 서비스, 교육, 블로그 섹션 등 보도자료 이외의 페이지는 뉴스와이어의 사전 서면
                  동의가 없는 한 복제 및 무단 게재할 수 없습니다. 그러나 사이트에 페이지를 링크를 하는 것은 허용합니다.
                </li>
              </ol>
            </div>

            <div className="terms-popup__paragraph">
              <p>제 5조 (면책)</p>
              <ol>
                <li>
                  “회사”는 “서비스” 이용과 관련하여 천재지변, 전쟁, 화재 등 사고, 통신 중단, 설비의 보수 및 교체,
                  정기점검, 프로그램 오류 등 부득이한 사유로 인하여 발생한 손해에 대하여 책임이 면제됩니다.
                </li>
                <li>
                  “회사”는 “이용자”의 고의 또는 과실로 인하여 발생한 “자료”의 도난, 파괴, 삭제, 변조 등 손해에 대한
                  책임이 면제됩니다.
                </li>
                <li>
                  “회사”는 “이용자”가 제출한 보도자료를 “회사”가 관할하지 않는 외부 사이트나 저작물 등에서 사용하는 데
                  대해 책임을 지지 않으며, “회사”가 관할하지 않는 외부 사이트의 보도자료나 보도자료를 인용해 작성된
                  뉴스를 수정하거나 삭제하는데 대한 책임이 면제됩니다.
                </li>
                <li>
                  “이용자”는 뉴스와이어 사이트의 사용에 전적인 책임이 있습니다. 이 약관에 특별히 명시된 경우를 제외하고
                  “서비스”는 상품성, 특정 목적에의 적합성, 배포 및 게재나 검색의 보장 등에 대해 보증을 하지 않습니다.
                </li>
                <li>결제를 하지 않은 무료 서비스에 대해서는 “회사”의 책임이 면제됩니다.</li>
              </ol>
            </div>

            <div className="terms-popup__paragraph">
              <p>제 6조 (결제)</p>
              <ol>
                <li>
                  “유료 서비스” 이용자는 서비스 이용 전에 서비스 요금을 결제해야 합니다. 부득이 한 사정으로 “회사”가
                  결제 전 서비스를 제공한 경우, “이용자”는 “회사”가 정한 기간 내에 서비스 요금을 지불해야 합니다.
                </li>
                <li>
                  “유료서비스” 요금은 결제 뒤에는 환불할 수 없습니다. 다만 결제 후 고객 사정으로 “유료서비스”를 사용하지
                  않은 경우, 결제 시점으로부터 1개월 이내에 한해 입금액의 80%를 환불합니다. “쿠폰”을 복수로 구매한 경우,
                  “쿠폰”을 1개라도 사용하면 환불하지 않습니다. 이 밖의 사항은 쌍방이 협의하여 해결합니다.
                </li>
                <li>구매한 ”쿠폰”의 유효기간은 1년이며, 1년이 지나면 사용할 수 없습니다.</li>
                <li>
                  “유료서비스” 요금을 결제하는 경우, 결제한 사용자가 속한 조직이 “유료서비스”를 사용할 권리를 갖습니다.
                  결제자가 대행사 소속 임직원인 경우, 대행사가 대행을 맡은 고객기업의 보도자료 배포에 “유료서비스”를
                  이용할 수 있습니다.
                </li>
                <li>
                  “유료 서비스”를 신청한 회원이 퇴직, 부서 이동 등의 사유로 “쿠폰”을 사용하지 못하는 경우, 쿠폰을 구매한
                  회원은 새로운 회원을 “서비스”에 가입시키고 “회사”에 이를 알려 이 회원이 “쿠폰”을 사용할 수 있도록 해야
                  합니다.
                </li>
                <li>
                  회원이 “유료서비스” 이용을 위해 결제를 하였으나 “회사”의 귀책 사유로 “유료서비스”를 사용하지 못한 경우
                  환불해 드립니다.
                </li>
              </ol>
            </div>

            <div className="terms-popup__paragraph">
              <p>제 7조 (분쟁의 해결)</p>
              <ol>
                <li>
                  “회사”와 “이용자”는 “서비스”와 관련하여 발생한 분쟁을 원만하게 해결하기 위하여 노력을 하여야 합니다.
                  모든 노력에도 불구하고 소송이 제기될 경우, “회사”의 본사 소재지 관할 법원을 전속 관할 법원으로 합니다.
                </li>
              </ol>
            </div>

            <div className="terms-popup__paragraph">
              <p>제 8 조 (약관의 개정)</p>
              <ol>
                <li>“회사”는 이 약관의 내용을 회원 등 “이용자”가 쉽게 알 수 있도록 “서비스” 초기 화면에 게시합니다.</li>
                <li>
                  “회사”는 약관의규제에관한법률, 정보통신망이용촉진및정보보호등에관한법률 등 관련법을 위배하지 않는
                  범위에서 이 약관을 개정할 수 있습니다.
                </li>
                <li>
                  “회사”가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 제1항의 방식에 따라 그
                  개정약관의 적용일자 15일 전부터 적용일자 전일까지 게시하고 이메일을 통해 통지합니다.
                </li>
                <li>
                  “회사”가 전항에 따라 개정약관을 공지하면서 회원에게 15일 기간 내에 의사표시를 하지 않으면 의사표시가
                  표명된 것으로 본다는 뜻을 명확하게 공지 또는 통지하였음에도 회원이 명시적으로 거부의 의사표시를 하지
                  아니한 경우 회원이 개정약관에 동의한 것으로 봅니다.
                </li>
                <li>
                  회원이 개정 약관의 적용에 동의하지 않는 경우 “회원”은 “서비스” 이용을 중단하고, 이용계약을 해지할 수
                  있습니다. 이용 계약을 해지하는 경우, “회사”는 “회원”의 계정과 개인정보를 사이트에서 삭제합니다.
                </li>
              </ol>
            </div>

            <div className="terms-popup__paragraph">
              <p>[부칙]</p>
              <ol>
                <li>이 약관은 2017년 6월 7일부터 시행합니다.</li>
                <li>
                  <Button
                    elem="a"
                    label={'이전 이용약관 보기'}
                    cate={'link-text'}
                    size={'m'}
                    color={'body-link'}
                    onClick={() => window.open('https://www.newswire.co.kr/?xd=37&y=201505', '_blank')}
                  />{' '}
                  (2015년 5월 26일 - 2017년 6월 6일 적용)
                </li>
              </ol>
            </div>

            <div className="terms-popup__paragraph">
              <p>
                제정 2004년 8월 1일 제정, 1차 개정 2004년 12월 20일, 2차 개정 2005년 8월 23일, 3차 개정 2006년 3월 2일,
                4차 개정 2006년 11월 15일, 5차 개정 2014년 11월 1일 개정, 6차 개정 2015년 5월 27일, 7차 개정 2017년 6월
                7일
              </p>
            </div>
          </div>
        </div>
      </Popup>
    </>
  )
}

export default TermsPopup
